:PROPERTIES:
:ID:       a0fb0653-7362-4cc3-9760-31f5b760acdb
:END:
#+TITLE: Gitlab: Basic transformation of GraphQL API
#+CATEGORY: slips
#+TAGS:

This is mostly repeated from [[github:ectorepo/kde][ectorepo/kde]], but has been bit cleaned up so it
will read more easily. It uses mostly mocked data instead of API calls.

** Gitlab Groups

Formatted as tab-separated. Use =--raw-output=. Data is below.

#+headers: :stdin eg-json :cmd-line --raw-output
#+begin_src jq :results output
.data.groups.nodes[]
  | [.name, .projects.count, .path, .fullPath, .description]
  | @tsv
#+end_src

#+RESULTS:
: 3rdparty	18	3rdparty	neon/3rdparty
: Accessibility	1	accessibility	teams/accessibility

*** Serializing JSON to TSV/XML

#+name: jq-proj
#+headers: :stdin eg-proj
#+headers: :cmd-line --raw-output
#+begin_src jq :results output
.data.group.projects.nodes[]
  | [.name, .path, .fullPath, .description, .repository.rootRef]
  | @tsv
#+end_src

#+RESULTS: jq-proj
: Plasma Workspace	plasma-workspace	plasma/plasma-workspace		master
: KDE Portal for XDG Desktop	xdg-desktop-portal-kde	plasma/xdg-desktop-portal-kde		master
: PowerDevil	powerdevil	plasma/powerdevil		master

Wait =xq= doesn't understand json?

Either use a specific tool or something like [[github:tyleradams/json-toolkit][tyleradams/json-toolkit]]. This
basically serializes the JSON to with a python =dict= as intermediate =XML= with
a few checks. There are plenty of =libxml2= dependents.

#+headers: :var json=eg-proj
#+begin_src sh :results output
echo $json | xq -x '.data.group.projects.nodes[] | [.name, .path, .fullPath, .description, .repository.rootRef]'
#+end_src

#+RESULTS:
: xq: Error running jq: ExpatError: syntax error: line 1, column 0.
: [ Babel evaluation exited with code 1 ]

*** Serialize from ELD to XML with =graphql-eld-to-xml=

Serialize from JSON to an emacs-lisp value.

#+name: eld-proj
#+begin_src emacs-lisp :results value :var json=eg-proj
(json-read-from-string json)
#+end_src

#+RESULTS: eld-proj
| data | (group (projects (nodes . [((id . gid://gitlab/Project/2703) (name . Plasma Workspace) (topics . []) (path . plasma-workspace) (fullPath . plasma/plasma-workspace) (visibility . public) (repository (rootRef . master) (exists . t))) ((id . gid://gitlab/Project/2163) (name . KDE Portal for XDG Desktop) (topics . []) (path . xdg-desktop-portal-kde) (fullPath . plasma/xdg-desktop-portal-kde) (visibility . public) (repository (rootRef . master) (exists . t))) ((id . gid://gitlab/Project/2559) (name . PowerDevil) (topics . []) (path . powerdevil) (fullPath . plasma/powerdevil) (visibility . public) (repository (rootRef . master) (exists . t)))]))) |

Really nothing works for the above except =:results value=, even =:results value
code=. It needs to be by the next =#+call= as a quoted list.

#+name: xml-proj
#+call: graphql-eld-to-xml(gqldata=eld-proj) :results value htmlx

#+RESULTS: xml-proj
#+begin_export html
<project name="plasma/plasma-workspace" path="plasma-workspace" revision="refs/heads/master" remote="invent"/>
<project name="plasma/powerdevil" path="powerdevil" revision="refs/heads/master" remote="invent"/>
<project name="plasma/xdg-desktop-portal-kde" path="xdg-desktop-portal-kde" revision="refs/heads/master" remote="invent"/>
#+end_export

